tests/integration/cassettes/TestInvoicePayment.test_create.json

{
  "http_interactions": [
    {
      "recorded_at": "2020-05-30T09:54:39",
      "request": {
        "body": {
          "encoding": "utf-8",
          "string": "{\"date\": \"2020-01-02\", \"paid_total\": 200, \"currency\": \"EUR\", \"invoice_id\": 1020383}"
        },
        "headers": {
          "Accept": [
            "*/*"
          ],
          "Accept-Encoding": [
            "gzip, deflate"
          ],
          "Authorization": [
            "Token token=<TOKEN>"
          ],
          "Connection": [
            "keep-alive"
          ],
          "Content-Length": [
            "83"
          ],
          "Content-Type": [
            "application/json"
          ],
          "User-Agent": [
            "python-requests/2.23.0"
          ]
        },
        "method": "POST",
        "uri": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/payments"
      },
      "response": {
        "body": {
          "base64_string": "H4sIAAAAAAAA/4TOwUrFMBCF4VeRs05lkrTaZu8LFN24CSGJMNCmJUyEIn13EbHe3d3+fDOcL3CCe6JeP48KKUiGgyFDHemODBS4fG4cM9wv1WTIjlaBUy7CH5wrHGZDRLqHgrAsPz9SW9fj4e/4VNgDJy+bhAXOED3SbfJcfIhxa0V8bLXmEo+L/Qe8vM1QiDUHyckHucYOnaVXmtzQOzu9Q6Ht6Y45vwMAAP//A0FKvPwAAAA=",
          "encoding": "utf-8",
          "string": ""
        },
        "headers": {
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Content-Encoding": [
            "gzip"
          ],
          "Content-Length": [
            "182"
          ],
          "Content-Type": [
            "application/json; charset=utf-8"
          ],
          "Date": [
            "Sat, 30 May 2020 09:54:39 GMT"
          ],
          "Etag": [
            "W/\"589465c0dc677e01ad2ff80954e95282\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Vary": [
            "Origin",
            "Accept-Encoding"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Download-Options": [
            "noopen"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Request-Id": [
            "933aae42-bfbf-4b6f-8127-7fb4f07d83b9"
          ],
          "X-Runtime": [
            "0.088928"
          ],
          "X-Xss-Protection": [
            "1; mode=block"
          ]
        },
        "status": {
          "code": 200,
          "message": "OK"
        },
        "url": "https://<DOMAIN>.mocoapp.com/api/v1/invoices/payments"
      }
    }
  ],
  "recorded_with": "betamax/0.8.1"
}